{
    "en": {
        "/start": "Hello, {}\\! You can use this bot to access your Strava data\\.\nTo start using the both please authorize it in Strava with /auth command\\.\n*Powered by Strava*\\.",
        "/auth": "Here's your auth link: [Connect with Strava]({})\n\n_Please check all the boxes on the auth pages, otherwise the bot will not work proreply\\._",
        "NOT_FOUND_IN_DB": "The bot didn't find your Telegram ID in the database. Please authorize the bot again with the /auth command.",
        "ERROR_WHILE_REFRESHING": "The bot can't update your Strava access token due to bad response from Stava API.\nUsually it happens when you revoke the access to the bot. Please authorize the bot one more time with the /auth command.",
        "FIND_INIT": "Send the time period to search your activities\\. It should be formatted like this:\n\n `YYYY\\-MM\\-DD YYYY\\-MM\\-DD`\n\nFirst date \\- start date to search activites, and the second one is the end of the time period\\.\nSelected time period should be less than *180 days*\\.\nYou can use /cancel command to stop the operation\\.",
        "CANCELLED": "The operation was cancelled.",
        "WRONG_PERIOD": "The time period you entered is incorrect.",
        "BAD_GPX_REQUEST": "The bot can't generate GPX file for this activity. Check if it has actual GPS data."
    },
    "ru": {
        "/start": "Здравствуй, {}\\! С помощью этого бота ты можешь получить доступ к своим тренировкам на Strava\\.\nЧтобы начать пользоваться ботом, используй команду /auth\\.\n*Powered by Strava*\\.",
        "/auth": "Вот ваша ссылка для авторизации бота: [Connect with Strava]({})\n\n_Пожалуйста отметьте все пункты доступа на странице авторизации, или бот не сможешь корректно работать\\._",
        "NOT_FOUND_IN_DB": "Бот не смог найти ваш Telegram ID в базе данных. Авторизуйте бота заново с помощью команды /auth.",
        "ERROR_WHILE_REFRESHING": "Бот не смог обновить ваш уникальный токен для доступа к Strava.\nСкорее всего вы деавторизовали бота в вашей учетной записи Strava. Авторизуйте бота заново с помощью команды /auth.",
        "FIND_INIT": "Чтобы найти ваши тренировки, пришлите мне диапазон дат для поиска\\. Сообщение должно быть отформатировано так:\n\n `YYYY\\-MM\\-DD YYYY\\-MM\\-DD`\n\nГде первая дата \\- это начало диапазона для поиска тренировок, а вторая \\- его конец\\.\nВыбранный период времени должен быть меньше *180 дней*\\.\nВы можете воспользоваться командой /cancel, чтобы отменить операцию\\.",
        "CANCELLED": "Операция отменена.",
        "WRONG_PERIOD": "Вы ввели некорректный промежуток времени.",
        "BAD_GPX_REQUEST": "Бот не смог сгенерировать GPX файл для данной активности. Проверьте, есть ли в этой тренировке GPS данные."
    }
}